JohannHoepfner/Wetterballon/flight-hardware/wwan_gateway/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_WWAN_GATEWAY_NOTIFICATION_SMS_RECEIPIENT=""

CONFIG_WWAN_GATEWAY_SERVER_HOST=""
CONFIG_WWAN_GATEWAY_SERVER_HTTP_PORT=80
CONFIG_WWAN_GATEWAY_SERVER_HTTP_USERNAME=""
CONFIG_WWAN_GATEWAY_SERVER_HTTP_PASSWORD=""

CONFIG_WWAN_GATEWAY_MODEM_PWK_PIN=11
CONFIG_WWAN_GATEWAY_MODEM_UART_TX_PIN=20
CONFIG_WWAN_GATEWAY_MODEM_UART_RX_PIN=21
CONFIG_WWAN_GATEWAY_MODEM_UART_CTS_PIN=22
CONFIG_WWAN_GATEWAY_MODEM_UART_RTS_PIN=23

CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_ENABLE_IPV6=n
CONFIG_LWIP_PPP_NOTIFY_PHASE_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y
